BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny26.PIC
        <edc:SFRDef edc:_addr="0x55" edc:access="-nnnn-nn" edc:cname="MCUCR" edc:impl="0x7B" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPU">
              <edc:SFRFieldDef edc:cname="ISC0" edc:desc="Interrupt Sense Control 0 bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Low Level of INTX" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Any Logical Change in INTX" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Falling Edge of INTX" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Rising Edge of INTX" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SM" edc:desc="Sleep Mode Select Bits" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ADC" edc:desc="ADC Noise Reduction (If Available)" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="PDOWN" edc:desc="Power Down" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STDBY" edc:desc="Standby" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SE" edc:desc="Sleep Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PUD" edc:desc="Pull-up Disable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x56" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x58" edc:access="-nn--nn-" edc:cname="TIFR" edc:impl="0x66" edc:nzwidth="0x8" ltx:memberofperipheral="TC0 TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TOV0" edc:desc="Timer/Counter0 Overflow Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="TC1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TOV1" edc:desc="Timer/Counter1 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="OCF1B" edc:desc="Timer/Counter1 Output Compare Flag 1B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF1A" edc:desc="Timer/Counter1 Output Compare Flag 1A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x59" edc:access="-nn--nn-" edc:cname="TIMSK" edc:impl="0x66" edc:nzwidth="0x8" ltx:memberofperipheral="TC0 TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TOIE0" edc:desc="Timer/Counter0 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="TC1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TOIE1" edc:desc="Timer/Counter1 Overflow Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="OCIE1B" edc:desc="Timer/Counter1 Output Compare Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCIE1A" edc:desc="Timer/Counter1 Output Compare Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5A" edc:access="-nn-----" edc:cname="GIFR" edc:impl="0x60" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXINT">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="PCIF" edc:desc="Pin Change Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INTF0" edc:desc="External Interrupt Flag 0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5B" edc:access="-nnn----" edc:cname="GIMSK" edc:impl="0x70" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EXINT">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="PCIE" edc:desc="Pin Change Interrupt Enables" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="External Interrupt Request 0 Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x5C" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x5D" edc:access="nnnnnnnn" edc:cname="SP" edc:nzwidth="0x8" ltx:memberofperipheral="CPU"/>
        <edc:AdjustPoint edc:_addr="0x5E" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x5F" edc:access="nnnnnnnn" edc:cname="SREG" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPU">
              <edc:SFRFieldDef edc:cname="C" edc:desc="Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="Zero Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="Negative Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="V" edc:desc="Two's Complement Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Sign Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="H" edc:desc="Half Carry Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T" edc:desc="Bit Copy Storage" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I" edc:desc="Global Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:beginaddr="0x60" edc:endaddr="0xE0" edc:regionid="IRAM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:DataFlashSpace edc:endaddr="0x400" edc:magicoffset="0x810000"/>
  <edc:SignaturesSpace edc:magicoffset="0x840000">
    <edc:DeviceIDSector edc:beginaddr="0x0" edc:endaddr="0x3" edc:regionid="SIGNATURES" edc:value="0x1E9109"/>
  </edc:SignaturesSpace>
  <edc:FusesSpace edc:magicoffset="0x820000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x2" edc:regionid="FUSES">
      <edc:DCRDef edc:_addr="0x0" edc:access="nnnnnnnn" edc:cname="LOW" edc:factorydefault="0xE1" edc:impl="0xFF" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
            <edc:DCRFieldDef edc:cname="PLLCK_SUT_CKSEL" edc:desc="Select Clock Source" edc:mask="0xBF" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="PLLCLK_1KCK_0MS" edc:desc="PLL Clock; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x01"/>
              <edc:DCRFieldSemantic edc:cname="PLLCLK_1KCK_4MS" edc:desc="PLL Clock; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PLLCLK_1KCK_64MS" edc:desc="PLL Clock; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="PLLCLK_16KCK_64MS" edc:desc="PLL Clock; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_0MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_4MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x90"/>
              <edc:DCRFieldSemantic edc:cname="EXTCLK_6CK_64MS" edc:desc="Ext. Clock; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA0"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_0MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x81"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_4MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x91"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_1MHZ_6CK_64MS" edc:desc="Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA1"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_0MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x82"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_4MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x92"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_2MHZ_6CK_64MS" edc:desc="Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA2"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_0MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x83"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_4MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x93"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_4MHZ_6CK_64MS" edc:desc="Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA3"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_0MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x84"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_4MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x94"/>
              <edc:DCRFieldSemantic edc:cname="INTRCOSC_8MHZ_6CK_64MS" edc:desc="Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA4"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_0MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x85"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_4MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x95"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_18CK_64MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA5"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_XX_0MHZ9_6CK_4MS" edc:desc="Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xB5"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x86"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x96"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA6"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_0MHZ9_3MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xB6"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x87"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x97"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA7"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_3MHZ_8MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xB7"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_0MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x88"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_4MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x98"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_18CK_64MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA8"/>
              <edc:DCRFieldSemantic edc:cname="EXTRCOSC_8MHZ_12MHZ_6CK_4MS" edc:desc="Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xB8"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_4MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x89"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_1KCK_64MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x99"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTAL_32KCK_64MS" edc:desc="Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xA9"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x8A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x9A"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0xAA"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xBA"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x8B"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x9B"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xAB"/>
              <edc:DCRFieldSemantic edc:cname="EXTLOFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xBB"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x8C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x9C"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0xAC"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xBC"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x8D"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x9D"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xAD"/>
              <edc:DCRFieldSemantic edc:cname="EXTMEDFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xBD"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_258CK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms" edc:when="(field &amp; 0xBF) == 0x8E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_258CK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x9E"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_0MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0xAE"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xBE"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_1KCK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0x8F"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_0MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms" edc:when="(field &amp; 0xBF) == 0x9F"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_4MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms" edc:when="(field &amp; 0xBF) == 0xAF"/>
              <edc:DCRFieldSemantic edc:cname="EXTHIFXTALRES_16KCK_64MS" edc:desc="Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms" edc:when="(field &amp; 0xBF) == 0xBF"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="-2"/>
            <edc:DCRFieldDef edc:cname="CKOPT" edc:desc="CKOPT fuse (operation dependent of CKSEL fuses)" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1" edc:access="---nnnnn" edc:cname="HIGH" edc:factorydefault="0xF7" edc:impl="0x1F" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="FUSE">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSE">
            <edc:DCRFieldDef edc:cname="BODEN" edc:desc="Brown-out detection enabled" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BODLEVEL" edc:desc="Brownout detector trigger level" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="4V0" edc:desc="Brown-out detection at VCC=4.0 V" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="2V7" edc:desc="Brown-out detection at VCC=2.7 V" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EESAVE" edc:desc="Preserve EEPROM through the Chip Erase cycle" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SPIEN" edc:desc="Serial program downloading (SPI) enabled" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RSTDISBL" edc:desc="Reset Disabled (Enable PB7 as i/o pin)" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:FusesSpace>
  <edc:LockbitsSpace edc:magicoffset="0x830000">
    <edc:ConfigFuseSector edc:beginaddr="0x0" edc:endaddr="0x1" edc:regionid="LOCKBITS">
      <edc:DCRDef edc:_addr="0x0" edc:access="------nn" edc:cname="LOCKBIT" edc:factorydefault="0xFF" edc:impl="0x3" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LB" edc:desc="Memory Lock" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PROG_VER_DISABLED" edc:desc="Further programming and verification disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:DCRFieldSemantic edc:cname="PROG_DISABLED" edc:desc="Further programming disabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:DCRFieldSemantic edc:cname="NO_LOCK" edc:desc="No memory lock features enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
</edc:PIC>